{
    "char2idx": {
        "ka2": 0,
        "er2": 1,
        "pu3": 2,
        "pei2": 3,
        "wai4": 4,
        "sun1": 5,
        "wan2": 6,
        "hua2": 7,
        "ti1": 8,
        "jia2": 9,
        "yu3": 10,
        "cun1": 11,
        "yan2": 12,
        "bie2": 13,
        "zai4": 14,
        "yong1": 15,
        "bao4": 16,
        "wo3": 17,
        "bao2": 18,
        "ma3": 19,
        "pei4": 20,
        "gua4": 21,
        "bo3": 22,
        "luo2": 23,
        "an1": 24,
        "diao1": 25,
        "chan2": 26,
        "yuan4": 27,
        "zhen3": 28,
        "dong3": 29,
        "weng1": 30,
        "ta4": 31,
        "deng4": 32,
        "xiao3": 33,
        "ping2": 34,
        "sa4": 35,
        "qie4": 36,
        "er3": 37,
        "hui4": 38,
        "wu4": 39,
        "lao2": 40,
        "hu3": 41,
        "you4": 42,
        "zai3": 43,
        "yu2": 44,
        "chong3": 45,
        "quan3": 46,
        "shua3": 47,
        "shen1": 48,
        "chang2": 49,
        "yue1": 50,
        "wu2": 51,
        "chi3": 52,
        "er4": 53,
        "cun4": 54,
        "wu3": 55,
        "fen1": 56,
        "huo4": 57,
        "yi3": 58,
        "shang4": 59,
        "zhao4": 60,
        "di2": 61,
        "cao2": 62,
        "yun2": 63,
        "teng2": 64,
        "qu4": 65,
        "gui3": 66,
        "wu1": 67,
        "zhan2": 68,
        "pin3": 69,
        "sui1": 70,
        "you3": 71,
        "zhan3": 72,
        "yuan2": 73,
        "que4": 74,
        "tui2": 75,
        "yi2": 76,
        "san3": 77,
        "ju1": 78,
        "tong2": 79,
        "he2": 80,
        "tuo1": 81,
        "wei2": 82,
        "zhu3": 83,
        "ke1": 84,
        "te4": 85,
        "ni1": 86,
        "chuan1": 87,
        "wen2": 88,
        "da4": 89,
        "yi1": 90,
        "yin3": 91,
        "cai2": 92,
        "yao4": 93,
        "shai1": 94,
        "yong4": 95,
        "ye3": 96,
        "nan2": 97,
        "yue4": 98,
        "kun1": 99,
        "lun2": 100,
        "shan1": 101,
        "xi1": 102,
        "zang4": 103,
        "jie1": 104,
        "rang3": 105,
        "kai3": 106,
        "lan2": 107,
        "fang2": 108,
        "ru3": 109,
        "xian4": 110,
        "ai2": 111,
        "xuan1": 112,
        "chuan2": 113,
        "hui2": 114,
        "heng1": 115,
        "heng5": 116,
        "zuo3": 117,
        "nai3": 118,
        "nai5": 119,
        "tiao1": 120,
        "xuan3": 121,
        "pi2": 122,
        "pa2": 123,
        "ci3": 124,
        "guang2": 125,
        "ben3": 126,
        "jiang1": 127,
        "you2": 128,
        "shao4": 129,
        "zhuang4": 130,
        "pai4": 131,
        "zhang2": 132,
        "guan3": 133,
        "man2": 134,
        "niao2": 135,
        "niao3": 136,
        "qiong2": 137,
        "ge1": 138,
        "yan3": 139,
        "kuang4": 140,
        "kuan1": 141,
        "kuo4": 142,
        "di1": 143,
        "ai3": 144,
        "bi2": 145,
        "duan3": 146,
        "xia2": 147,
        "ya2": 148,
        "cheng2": 149,
        "zhen4": 150,
        "qi2": 151,
        "wa3": 152,
        "yao2": 153,
        "shui3": 154,
        "wei4": 155,
        "meng2": 156,
        "zhang3": 157,
        "si1": 158,
        "yan4": 159,
        "lu4": 160,
        "bei4": 161,
        "xiu4": 162,
        "gou1": 163,
        "xing4": 164,
        "gan3": 165,
        "re2": 166,
        "huo3": 167,
        "ke2": 168,
        "gei3": 169,
        "ben2": 170,
        "wei3": 171,
        "fan3": 172,
        "ying4": 173,
        "you5": 174,
        "pai2": 175,
        "gai4": 176,
        "jian4": 177,
        "ying1": 178,
        "fang1": 179,
        "nai2": 180,
        "fen3": 181,
        "e4": 182,
        "yu4": 183,
        "lu2": 184,
        "wan3": 185,
        "su1": 186,
        "ju2": 187,
        "di4": 188,
        "xia4": 189,
        "xue1": 190,
        "zi5": 191,
        "guan1": 192,
        "dian3": 193,
        "zhai1": 194,
        "chen2": 195,
        "luo4": 196,
        "bi4": 197,
        "xiu1": 198,
        "hua1": 199,
        "xu3": 200,
        "guan4": 201,
        "yi4": 202,
        "ming2": 203,
        "ri4": 204,
        "chu1": 205,
        "bin4": 206,
        "a1": 207,
        "jiao1": 208,
        "bai3": 209,
        "gui2": 210,
        "kuang2": 211,
        "huan1": 212,
        "mai3": 213,
        "mai4": 214,
        "qi4": 215,
        "shou1": 216,
        "tiao2": 217,
        "liu4": 218,
        "wanr1": 219,
        "dou1": 220,
        "dei3": 221,
        "duo2": 222,
        "hei1": 223,
        "xiong2": 224,
        "chuang3": 225,
        "jin4": 226,
        "wang2": 227,
        "hui1": 228,
        "jia1": 229,
        "hou4": 230,
        "mi4": 231,
        "shi2": 232,
        "ya4": 233,
        "jun1": 234,
        "zhang4": 235,
        "fu5": 236,
        "cai4": 237,
        "kui2": 238,
        "xiao1": 239,
        "suan1": 240,
        "wei1": 241,
        "xian2": 242,
        "rong2": 243,
        "qiang2": 244,
        "mian2": 245,
        "zhe1": 246,
        "le5": 247,
        "yin1": 248,
        "xuan2": 249,
        "wo2": 250,
        "min3": 251,
        "yin2": 252,
        "chi1": 253,
        "mao3": 254,
        "liang2": 255,
        "zhi2": 256,
        "ke3": 257,
        "lv2": 258,
        "pao3": 259,
        "kuai4": 260,
        "feng1": 261,
        "ye2": 262,
        "de5": 263,
        "cha4": 264,
        "guo4": 265,
        "qir4": 266,
        "guang1": 267,
        "gun4": 268,
        "jie2": 269,
        "ying2": 270,
        "yun4": 271,
        "sheng1": 272,
        "gao1": 273,
        "ya1": 274,
        "tie2": 275,
        "ta3": 276,
        "peng2": 277,
        "dian4": 278,
        "hai3": 279,
        "pin2": 280,
        "min2": 281,
        "ku1": 282,
        "wan4": 283,
        "fu4": 284,
        "lie4": 285,
        "ling4": 286,
        "an4": 287,
        "chu2": 288,
        "li3": 289,
        "ru2": 290,
        "dai4": 291,
        "wo4": 292,
        "luan2": 293,
        "jian1": 294,
        "chui1": 295,
        "yan1": 296,
        "rao4": 297,
        "bo2": 298,
        "qing1": 299,
        "zui3": 300,
        "ba5": 301,
        "zhou1": 302,
        "lve4": 303,
        "zhong2": 304,
        "qi3": 305,
        "xiao4": 306,
        "sa2": 307,
        "man3": 308,
        "zhuang1": 309,
        "sha1": 310,
        "chang3": 311,
        "jing4": 312,
        "yun3": 313,
        "ming4": 314,
        "zhi4": 315,
        "zha2": 316,
        "dou4": 317,
        "pen1": 318,
        "xiang1": 319,
        "ma2": 320,
        "beng1": 321,
        "cui4": 322,
        "zi3": 323,
        "mei4": 324,
        "tuan2": 325,
        "shu3": 326,
        "zhen1": 327,
        "tai4": 328,
        "kou1": 329,
        "menr2": 330,
        "lin4": 331,
        "dong1": 332,
        "zhu4": 333,
        "bing4": 334,
        "xu1": 335,
        "shuan1": 336,
        "yang3": 337,
        "juan4": 338,
        "he4": 339,
        "li4": 340,
        "yin4": 341,
        "du4": 342,
        "lang2": 343,
        "nai4": 344,
        "jing1": 345,
        "shu4": 346,
        "nan4": 347,
        "xiong1": 348,
        "hao2": 349,
        "hao3": 350,
        "qie1": 351,
        "cuo1": 352,
        "tui3": 353,
        "nei4": 354,
        "ce4": 355,
        "yu1": 356,
        "ji2": 357,
        "ci2": 358,
        "kong2": 359,
        "zi2": 360,
        "tu2": 361,
        "nv2": 362,
        "pai1": 363,
        "wen3": 364,
        "xi4": 365,
        "chun1": 366,
        "bu2": 367,
        "pa4": 368,
        "cai3": 369,
        "cu4": 370,
        "fang3": 371,
        "zhi1": 372,
        "cu1": 373,
        "ni2": 374,
        "deng3": 375,
        "mian4": 376,
        "liao4": 377,
        "qiao3": 378,
        "miao4": 379,
        "se4": 380,
        "fu1": 381,
        "tie1": 382,
        "lou3": 383,
        "nu2": 384,
        "de2": 385,
        "ye1": 386,
        "wa2": 387,
        "qing3": 388,
        "yong3": 389,
        "kang1": 390,
        "zhuan3": 391,
        "da2": 392,
        "dui4": 393,
        "bang1": 394,
        "guo2": 395,
        "qin1": 396,
        "wen4": 397,
        "jin1": 398,
        "juan1": 399,
        "shen4": 400,
        "pang4": 401,
        "sao3": 402,
        "sao5": 403,
        "zuo4": 404,
        "wo1": 405,
        "wo5": 406,
        "yang2": 407,
        "rou4": 408,
        "dun4": 409,
        "man4": 410,
        "gang2": 411,
        "kou3": 412,
        "ya3": 413,
        "shu1": 414,
        "lao3": 415,
        "gong1": 416,
        "shai4": 417,
        "en1": 418,
        "ai4": 419,
        "wa4": 420,
        "tan1": 421,
        "ban3": 422,
        "quan2": 423,
        "ji4": 424,
        "chou2": 425,
        "zi1": 426,
        "jiu3": 427,
        "zha1": 428,
        "zou4": 429,
        "qu3": 430,
        "ti3": 431,
        "xue2": 432,
        "dao4": 433,
        "yuan3": 434,
        "wang3": 435,
        "gou4": 436,
        "sou1": 437,
        "gu3": 438,
        "xin4": 439,
        "ru4": 440,
        "weng4": 441,
        "kai2": 442,
        "mu3": 443,
        "xie2": 444,
        "chong1": 445,
        "ci4": 446,
        "diao4": 447,
        "tai2": 448,
        "huang2": 449,
        "chi4": 450,
        "san1": 451,
        "dao3": 452,
        "shang2": 453,
        "sheng4": 454,
        "huai2": 455,
        "chan3": 456,
        "ye4": 457,
        "ti4": 458,
        "zhe5": 459,
        "bei2": 460,
        "huan2": 461,
        "ban1": 462,
        "tang2": 463,
        "shang1": 464,
        "neng2": 465,
        "fou2": 466,
        "gai3": 467,
        "kong4": 468,
        "chuan4": 469,
        "mou2": 470,
        "bu4": 471,
        "lv3": 472,
        "qian2": 473,
        "zhe2": 474,
        "la1": 475,
        "fei2": 476,
        "shui2": 477,
        "ken2": 478,
        "she3": 479,
        "shi1": 480,
        "ta1": 481,
        "ne5": 482,
        "zei2": 483,
        "lou4": 484,
        "zi4": 485,
        "cheng1": 486,
        "huan4": 487,
        "zu2": 488,
        "zui4": 489,
        "cuo2": 490,
        "xia1": 491,
        "kua1": 492,
        "li2": 493,
        "da3": 494,
        "luan4": 495,
        "beng4": 496,
        "zhuo2": 497,
        "shuo1": 498,
        "xue3": 499,
        "jiao3": 500,
        "ruo4": 501,
        "lei4": 502,
        "miao2": 503,
        "duo1": 504,
        "chuan3": 505,
        "song2": 506,
        "kan4": 507,
        "kan5": 508,
        "tie3": 509,
        "hao4": 510,
        "zhe3": 511,
        "zhang1": 512,
        "biao2": 513,
        "pi1": 514,
        "zhuan1": 515,
        "xin1": 516,
        "gen1": 517,
        "lin3": 518,
        "zhun1": 519,
        "ding1": 520,
        "ning2": 521,
        "wang4": 522,
        "tian1": 523,
        "bu3": 524,
        "qing2": 525,
        "shi4": 526,
        "daor4": 527,
        "zou3": 528,
        "ren2": 529,
        "gao3": 530,
        "can1": 531,
        "xing2": 532,
        "wang1": 533,
        "fei1": 534,
        "zhen2": 535,
        "suo3": 536,
        "hou2": 537,
        "gan4": 538,
        "a5": 539,
        "ni3": 540,
        "lai2": 541,
        "da5": 542,
        "shei2": 543,
        "ka3": 544,
        "mei2": 545,
        "hai2": 546,
        "shou4": 547,
        "sun3": 548,
        "song4": 549,
        "ban4": 550,
        "pan2": 551,
        "zheng4": 552,
        "sun2": 553,
        "hui3": 554,
        "zhao2": 555,
        "lou2": 556,
        "kong1": 557,
        "long2": 558,
        "lin2": 559,
        "mai2": 560,
        "mo4": 561,
        "ji3": 562,
        "qiu1": 563,
        "hu4": 564,
        "fa4": 565,
        "gui1": 566,
        "mao4": 567,
        "xun4": 568,
        "gong4": 569,
        "sheng3": 570,
        "bao3": 571,
        "dan1": 572,
        "yuanr4": 573,
        "liu1": 574,
        "ji1": 575,
        "zhong1": 576,
        "zhan1": 577,
        "guang3": 578,
        "yao1": 579,
        "qian1": 580,
        "ke4": 581,
        "chong2": 582,
        "sou3": 583,
        "chai2": 584,
        "qin2": 585,
        "mou3": 586,
        "lian3": 587,
        "pen2": 588,
        "pu1": 589,
        "mie4": 590,
        "tao4": 591,
        "du2": 592,
        "wa5": 593,
        "yang4": 594,
        "kao3": 595,
        "que1": 596,
        "duan2": 597,
        "liang3": 598,
        "shang5": 599,
        "tai1": 600,
        "zheng5": 601,
        "ben1": 602,
        "hang2": 603,
        "duo4": 604,
        "jia3": 605,
        "yuan5": 606,
        "pao2": 607,
        "shi5": 608,
        "ba1": 609,
        "en4": 610,
        "huang1": 611,
        "fa1": 612,
        "dong4": 613,
        "tu4": 614,
        "kai1": 615,
        "sui4": 616,
        "bi3": 617,
        "po1": 618,
        "tu3": 619,
        "can2": 620,
        "shu2": 621,
        "bian1": 622,
        "nian2": 623,
        "ha1": 624,
        "jiu1": 625,
        "jun4": 626,
        "suan4": 627,
        "ku2": 628,
        "ze2": 629,
        "xing1": 630,
        "fen4": 631,
        "tun1": 632,
        "kou2": 633,
        "xian1": 634,
        "ling3": 635,
        "han4": 636,
        "gan1": 637,
        "die1": 638,
        "hong2": 639,
        "mo2": 640,
        "rui3": 641,
        "ka1": 642,
        "pian4": 643,
        "mei3": 644,
        "jie4": 645,
        "song1": 646,
        "ge2": 647,
        "mu4": 648,
        "bing3": 649,
        "mang3": 650,
        "she2": 651,
        "men2": 652,
        "ding3": 653,
        "duan1": 654,
        "tao2": 655,
        "feng4": 656,
        "rui4": 657,
        "nong5": 658,
        "chao2": 659,
        "liu2": 660,
        "ling2": 661,
        "dei2": 662,
        "yao3": 663,
        "ren3": 664,
        "ya5": 665,
        "zhe4": 666,
        "wen5": 667,
        "la5": 668,
        "tao1": 669,
        "nv3": 670,
        "shou3": 671,
        "guang4": 672,
        "ceng2": 673,
        "zhong4": 674,
        "cao3": 675,
        "zuo1": 676,
        "fang5": 677,
        "qiao2": 678,
        "xie1": 679,
        "que2": 680,
        "guai3": 681,
        "jiu4": 682,
        "jiu5": 683,
        "zhi3": 684,
        "shao2": 685,
        "han2": 686,
        "ou1": 687,
        "fa3": 688,
        "zhun2": 689,
        "tong5": 690,
        "jie3": 691,
        "tu1": 692,
        "xie4": 693,
        "pian1": 694,
        "zao1": 695,
        "chao3": 696,
        "gu2": 697,
        "qiang1": 698,
        "gai1": 699,
        "nao4": 700,
        "na2": 701,
        "dao1": 702,
        "chuo1": 703,
        "fang4": 704,
        "qing4": 705,
        "sao4": 706,
        "zhou5": 707,
        "ang2": 708,
        "shou2": 709,
        "ting3": 710,
        "jiong2": 711,
        "shen2": 712,
        "shuang1": 713,
        "tiao4": 714,
        "mao2": 715,
        "ding4": 716,
        "hun1": 717,
        "deng1": 718,
        "ta2": 719,
        "hen3": 720,
        "di5": 721,
        "le4": 722,
        "ti2": 723,
        "niu2": 724,
        "ju4": 725,
        "zai2": 726,
        "lei2": 727,
        "cang1": 728,
        "ying5": 729,
        "jin3": 730,
        "tan2": 731,
        "ren4": 732,
        "zong2": 733,
        "tong3": 734,
        "gu4": 735,
        "xie3": 736,
        "shi3": 737,
        "chuo4": 738,
        "feng3": 739,
        "tou2": 740,
        "chen4": 741,
        "di3": 742,
        "re4": 743,
        "gang3": 744,
        "chou3": 745,
        "xu4": 746,
        "zai1": 747,
        "zang1": 748,
        "nu3": 749,
        "ba4": 750,
        "nong2": 751,
        "huo2": 752,
        "zan2": 753,
        "wan5": 754,
        "bao1": 755,
        "ruan3": 756,
        "nian4": 757,
        "shao1": 758,
        "jir1": 759,
        "xiao2": 760,
        "chui2": 761,
        "si3": 762,
        "ju3": 763,
        "sang4": 764,
        "reng2": 765,
        "dang3": 766,
        "peng3": 767,
        "fan4": 768,
        "du1": 769,
        "ni4": 770,
        "zong4": 771,
        "ao1": 772,
        "ga1": 773,
        "mo3": 774,
        "tuo4": 775,
        "mo5": 776,
        "san4": 777,
        "niao4": 778,
        "tong4": 779,
        "heng2": 780,
        "e2": 781,
        "che1": 782,
        "lan4": 783,
        "peng1": 784,
        "pu2": 785,
        "fa2": 786,
        "ma1": 787,
        "sha3": 788,
        "han1": 789,
        "ge5": 790,
        "tian2": 791,
        "jiang4": 792,
        "jiang5": 793,
        "wen1": 794,
        "hua4": 795,
        "xian3": 796,
        "hu2": 797,
        "ku3": 798,
        "nuo2": 799,
        "xiang3": 800,
        "dun1": 801,
        "gen4": 802,
        "suo2": 803,
        "she4": 804,
        "nuan2": 805,
        "nuan3": 806,
        "biao1": 807,
        "bai2": 808,
        "chan1": 809,
        "jing2": 810,
        "lian4": 811,
        "xun2": 812,
        "jian3": 813,
        "zuan3": 814,
        "zhu1": 815,
        "sa3": 816,
        "chuang2": 817,
        "nong4": 818,
        "lian2": 819,
        "wa1": 820,
        "hang1": 821,
        "nian3": 822,
        "bei1": 823,
        "tie4": 824,
        "xiang4": 825,
        "jiao4": 826,
        "zu3": 827,
        "zong1": 828,
        "sheng2": 829,
        "cuo4": 830,
        "dai3": 831,
        "men5": 832,
        "lun1": 833,
        "jia4": 834,
        "si2": 835,
        "qia3": 836,
        "tan5": 837,
        "kong3": 838,
        "nve4": 839,
        "qie2": 840,
        "jiu2": 841,
        "jing3": 842,
        "quan1": 843,
        "ge4": 844,
        "guang5": 845,
        "liao2": 846,
        "liao5": 847,
        "ken3": 848,
        "zhui1": 849,
        "kan3": 850,
        "dang2": 851,
        "zong3": 852,
        "nie4": 853,
        "zeng1": 854,
        "zhou4": 855,
        "bin1": 856,
        "sui2": 857,
        "zhua1": 858,
        "jiang3": 859,
        "zuo5": 860,
        "pao4": 861,
        "cha2": 862,
        "he1": 863,
        "dang1": 864,
        "jie5": 865,
        "zao3": 866,
        "nen4": 867,
        "gao4": 868,
        "yong2": 869,
        "xi3": 870,
        "ting2": 871,
        "shen3": 872,
        "dou3": 873,
        "qi1": 874,
        "cou4": 875,
        "cong2": 876,
        "chu4": 877,
        "kang4": 878,
        "rao2": 879,
        "qiu2": 880,
        "run4": 881,
        "nin2": 882,
        "huir4": 883,
        "nu4": 884,
        "qia4": 885,
        "shan3": 886,
        "ne4": 887,
        "o5": 888,
        "dia2": 889,
        "dia3": 890,
        "sai1": 891,
        "chang4": 892,
        "shun4": 893,
        "chao1": 894,
        "tang4": 895,
        "gou2": 896,
        "cuan1": 897,
        "zhai4": 898,
        "quan4": 899,
        "su2": 900,
        "she1": 901,
        "chi2": 902,
        "qu2": 903,
        "chuang1": 904,
        "da1": 905,
        "qu1": 906,
        "zhan4": 907,
        "liang4": 908,
        "ceng4": 909,
        "zhong3": 910,
        "chou5": 911,
        "miao3": 912,
        "che2": 913,
        "fu2": 914,
        "ge3": 915,
        "zheng1": 916,
        "tou4": 917,
        "fen5": 918,
        "hong4": 919,
        "si4": 920,
        "ben4": 921,
        "ben5": 922,
        "hair2": 923,
        "liu3": 924,
        "kao2": 925,
        "yun1": 926,
        "geng1": 927,
        "ga4": 928,
        "ning3": 929,
        "ran2": 930,
        "chuai4": 931,
        "juan3": 932,
        "dan4": 933,
        "gong2": 934,
        "cong1": 935,
        "hai5": 936,
        "jue2": 937,
        "geng4": 938,
        "pi3": 939,
        "qie3": 940,
        "ba2": 941,
        "zao4": 942,
        "zuo2": 943,
        "xue4": 944,
        "shuo4": 945,
        "an3": 946,
        "an2": 947,
        "xing3": 948,
        "cui1": 949,
        "die2": 950,
        "biao3": 951,
        "ai1": 952,
        "zhou2": 953,
        "bang3": 954,
        "nang2": 955,
        "shun3": 956,
        "pei1": 957,
        "nuo4": 958,
        "piao1": 959,
        "mo1": 960,
        "lang4": 961,
        "guo1": 962,
        "gui4": 963,
        "zhu2": 964,
        "tong1": 965,
        "na4": 966,
        "bang4": 967,
        "kuan3": 968,
        "chen1": 969,
        "guo3": 970,
        "lv4": 971,
        "qun2": 972,
        "ma5": 973,
        "tui4": 974,
        "chou4": 975,
        "sheng5": 976,
        "zhun3": 977,
        "bei3": 978,
        "za2": 979,
        "bing1": 980,
        "hu1": 981,
        "gou3": 982,
        "deng2": 983,
        "dou2": 984,
        "gong3": 985,
        "kou4": 986,
        "gang1": 987,
        "bai1": 988,
        "na3": 989,
        "la3": 990,
        "yao5": 991,
        "fu3": 992,
        "lia3": 993,
        "xing5": 994,
        "lai4": 995,
        "su4": 996,
        "bian4": 997,
        "can4": 998,
        "kui4": 999,
        "pan5": 1000,
        "cai1": 1001,
        "mu2": 1002,
        "leng2": 1003,
        "tao5": 1004,
        "la4": 1005,
        "zheng2": 1006,
        "kun3": 1007,
        "cha1": 1008,
        "me5": 1009,
        "cao1": 1010,
        "lao1": 1011,
        "dao2": 1012,
        "you1": 1013,
        "xuan4": 1014,
        "shui4": 1015,
        "jiao2": 1016,
        "long5": 1017,
        "fei3": 1018,
        "qiao4": 1019,
        "zao2": 1020,
        "zhao1": 1021,
        "rang4": 1022,
        "jian2": 1023,
        "tao3": 1024,
        "fan1": 1025,
        "mang2": 1026,
        "keng1": 1027,
        "fei4": 1028,
        "bi1": 1029,
        "ze4": 1030,
        "lu5": 1031,
        "zan4": 1032,
        "wanr2": 1033,
        "men1": 1034,
        "pang2": 1035,
        "huai4": 1036,
        "tian3": 1037,
        "gang4": 1038,
        "ca1": 1039,
        "hen2": 1040,
        "yuan1": 1041,
        "zen3": 1042,
        "mi3": 1043,
        "bo1": 1044,
        "nen5": 1045,
        "pa1": 1046,
        "ting1": 1047,
        "de4": 1048,
        "chan4": 1049,
        "xun1": 1050,
        "fan2": 1051,
        "wan1": 1052,
        "zai5": 1053,
        "mi2": 1054,
        "yir4": 1055,
        "kao4": 1056,
        "sa1": 1057,
        "leng3": 1058,
        "dang4": 1059,
        "ba3": 1060,
        "sou5": 1061,
        "hun2": 1062,
        "zhui4": 1063,
        "tou1": 1064,
        "lun4": 1065,
        "duo3": 1066,
        "dian2": 1067,
        "po4": 1068,
        "bai4": 1069,
        "xiang2": 1070,
        "geng3": 1071,
        "mian3": 1072,
        "cui3": 1073,
        "ying3": 1074,
        "gei2": 1075,
        "dan3": 1076,
        "huang3": 1077,
        "gu1": 1078,
        "niang5": 1079,
        "sha2": 1080,
        "piao4": 1081,
        "qiao1": 1082,
        "chu3": 1083,
        "geng2": 1084,
        "bu5": 1085,
        "du3": 1086,
        "tun2": 1087,
        "kun2": 1088,
        "san2": 1089,
        "nao2": 1090,
        "gun2": 1091,
        "gun3": 1092,
        "dong2": 1093,
        "ku4": 1094,
        "rong3": 1095,
        "za3": 1096,
        "ran3": 1097,
        "guo5": 1098,
        "pu4": 1099,
        "ye5": 1100,
        "gu5": 1101,
        "duan4": 1102,
        "chun2": 1103,
        "ao2": 1104,
        "tang1": 1105,
        "shuai2": 1106,
        "qian4": 1107,
        "shen5": 1108,
        "zui2": 1109,
        "meng3": 1110,
        "kuang1": 1111,
        "tan4": 1112,
        "piao2": 1113,
        "ou2": 1114,
        "niu3": 1115,
        "hong1": 1116,
        "zha4": 1117,
        "gua3": 1118,
        "sai4": 1119,
        "juan2": 1120,
        "nian1": 1121,
        "cen1": 1122,
        "ci1": 1123,
        "ang1": 1124,
        "kang2": 1125,
        "shao3": 1126,
        "niang2": 1127,
        "zhua3": 1128,
        "shuang3": 1129,
        "wai1": 1130,
        "wai3": 1131,
        "zeng4": 1132,
        "tuo2": 1133,
        "men4": 1134,
        "xu2": 1135,
        "hou3": 1136,
        "zhai3": 1137,
        "chang1": 1138,
        "nao3": 1139,
        "gua1": 1140,
        "chou1": 1141,
        "qiu5": 1142,
        "zhuai4": 1143,
        "lai5": 1144,
        "bian2": 1145,
        "tui1": 1146,
        "wai2": 1147,
        "qiang3": 1148,
        "cen2": 1149,
        "ban2": 1150,
        "mao5": 1151,
        "lu3": 1152,
        "cang2": 1153,
        "ping1": 1154,
        "pang1": 1155,
        "pan1": 1156,
        "chuang4": 1157,
        "pan4": 1158,
        "sang3": 1159,
        "hua5": 1160,
        "renr4": 1161,
        "zou1": 1162,
        "li5": 1163,
        "tai5": 1164,
        "xi2": 1165,
        "pir2": 1166,
        "nar4": 1167,
        "pie1": 1168,
        "bing2": 1169,
        "luan3": 1170,
        "chun3": 1171,
        "sao2": 1172,
        "jinr4": 1173,
        "jiong3": 1174,
        "bang2": 1175,
        "ao4": 1176,
        "qian3": 1177,
        "nang5": 1178,
        "sa5": 1179,
        "mei5": 1180,
        "liang5": 1181,
        "gan2": 1182,
        "zou2": 1183,
        "peng5": 1184,
        "gunr4": 1185,
        "meng4": 1186,
        "er5": 1187,
        "fa5": 1188,
        "zhuo1": 1189,
        "pen4": 1190,
        "jingr3": 1191,
        "zuan1": 1192,
        "tan3": 1193,
        "dan2": 1194,
        "niang4": 1195,
        "chai1": 1196,
        "ou3": 1197,
        "jia5": 1198,
        "biao4": 1199,
        "shua1": 1200,
        "han3": 1201,
        "cun2": 1202,
        "re3": 1203,
        "ha2": 1204,
        "duor3": 1205,
        "rao3": 1206,
        "liao3": 1207,
        "xi5": 1208,
        "reng1": 1209,
        "kan2": 1210,
        "shan4": 1211,
        "la2": 1212,
        "shuai3": 1213,
        "bo5": 1214,
        "feng2": 1215,
        "e1": 1216,
        "yong5": 1217,
        "shao5": 1218,
        "qin3": 1219,
        "menr5": 1220,
        "guan2": 1221,
        "ao3": 1222,
        "fo2": 1223,
        "miu4": 1224,
        "huo1": 1225,
        "fanr4": 1226,
        "hai4": 1227,
        "guai1": 1228,
        "duo5": 1229,
        "ma4": 1230,
        "qia1": 1231,
        "rou2": 1232,
        "lo5": 1233,
        "mie1": 1234,
        "pi4": 1235,
        "shan2": 1236,
        "e3": 1237,
        "ning4": 1238,
        "ou4": 1239,
        "zun1": 1240,
        "che4": 1241,
        "kua4": 1242,
        "zhi5": 1243,
        "ji5": 1244,
        "long3": 1245,
        "sui3": 1246,
        "sao1": 1247,
        "ter4": 1248,
        "zu1": 1249,
        "huan3": 1250,
        "bie1": 1251,
        "shua2": 1252,
        "yue5": 1253,
        "leng4": 1254,
        "cu2": 1255,
        "gua2": 1256,
        "bei5": 1257,
        "ming3": 1258,
        "hun4": 1259,
        "tei1": 1260,
        "jiang2": 1261,
        "ruan2": 1262,
        "nie1": 1263,
        "rui2": 1264,
        "dian1": 1265,
        "pin1": 1266,
        "kan1": 1267,
        "shuang2": 1268,
        "zhou3": 1269,
        "lir3": 1270,
        "weir4": 1271,
        "xie5": 1272,
        "huang4": 1273,
        "gai2": 1274,
        "lin1": 1275,
        "dui1": 1276,
        "fan5": 1277,
        "qin4": 1278,
        "shang3": 1279,
        "tuo5": 1280,
        "zhao3": 1281,
        "zheng3": 1282,
        "lang3": 1283,
        "sang1": 1284,
        "dao5": 1285,
        "si5": 1286,
        "qu5": 1287,
        "sen1": 1288,
        "zuan4": 1289,
        "yi5": 1290,
        "che3": 1291,
        "nv5": 1292,
        "feng5": 1293,
        "zuan2": 1294,
        "kun4": 1295,
        "nan5": 1296,
        "zan1": 1297,
        "shuai4": 1298,
        "die5": 1299,
        "chuai1": 1300,
        "song3": 1301,
        "guai2": 1302,
        "bie3": 1303,
        "fen2": 1304,
        "xu5": 1305,
        "yang5": 1306,
        "zhuan4": 1307,
        "qing5": 1308,
        "zha5": 1309,
        "e5": 1310,
        "bo4": 1311,
        "mi1": 1312,
        "dun3": 1313,
        "chuai3": 1314,
        "kao1": 1315,
        "tuo3": 1316,
        "kai4": 1317,
        "jin2": 1318,
        "lao5": 1319,
        "hen4": 1320,
        "bian3": 1321,
        "nao5": 1322,
        "suo1": 1323,
        "nan3": 1324,
        "kua2": 1325,
        "kuan2": 1326,
        "fou3": 1327,
        "pian2": 1328,
        "cui5": 1329,
        "pou1": 1330,
        "tour2": 1331,
        "niu1": 1332,
        "niu5": 1333,
        "lia2": 1334,
        "cong5": 1335,
        "qin5": 1336,
        "pao1": 1337,
        "lan5": 1338,
        "hanr4": 1339,
        "zen2": 1340,
        "shuai1": 1341,
        "po2": 1342,
        "huan5": 1343,
        "gui5": 1344,
        "shir4": 1345,
        "chang5": 1346,
        "seng1": 1347,
        "bian5": 1348,
        "yo5": 1349,
        "lei3": 1350,
        "tou5": 1351,
        "gong5": 1352,
        "dianr3": 1353,
        "ju5": 1354,
        "lanr4": 1355,
        "gao2": 1356,
        "hou5": 1357,
        "na5": 1358,
        "tang5": 1359,
        "tang3": 1360,
        "dai1": 1361,
        "lan3": 1362,
        "cuan4": 1363,
        "tun5": 1364,
        "duir4": 1365,
        "piao3": 1366,
        "guai4": 1367,
        "fur4": 1368,
        "nar3": 1369,
        "zhei4": 1370,
        "qie5": 1371,
        "peng4": 1372,
        "ming5": 1373,
        "sha4": 1374,
        "po5": 1375,
        "qiang4": 1376,
        "shuan4": 1377,
        "jue4": 1378,
        "qi5": 1379,
        "mao1": 1380,
        "shun2": 1381,
        "nar2": 1382,
        "kui1": 1383,
        "bie4": 1384,
        "pa5": 1385,
        "dunr3": 1386,
        "cun3": 1387,
        "kua3": 1388,
        "long4": 1389,
        "diu1": 1390,
        "han5": 1391,
        "ding2": 1392,
        "liar3": 1393,
        "kuair4": 1394,
        "ga2": 1395,
        "shuai5": 1396,
        "pin4": 1397,
        "teng5": 1398,
        "tuan3": 1399,
        "heng4": 1400,
        "tuan1": 1401,
        "he5": 1402,
        "yo1": 1403,
        "luo5": 1404,
        "zu5": 1405,
        "yang1": 1406,
        "jing5": 1407,
        "genr1": 1408,
        "beng2": 1409,
        "wang5": 1410,
        "zher4": 1411,
        "mingr2": 1412,
        "gou5": 1413,
        "tuan5": 1414,
        "hong3": 1415,
        "lie1": 1416,
        "can3": 1417,
        "hai1": 1418,
        "tiao3": 1419,
        "nan1": 1420,
        "duir1": 1421,
        "za1": 1422,
        "cheng3": 1423,
        "ga3": 1424,
        "lie2": 1425,
        "cuan2": 1426,
        "miao1": 1427,
        "ti5": 1428,
        "tuan4": 1429,
        "ting5": 1430,
        "quan5": 1431,
        "zan3": 1432,
        "sha5": 1433,
        "xiu3": 1434,
        "bao5": 1435,
        "mou5": 1436,
        "ren5": 1437,
        "ca3": 1438,
        "pie3": 1439,
        "dou5": 1440,
        "dai5": 1441,
        "hu5": 1442,
        "zhunr3": 1443,
        "zhuan2": 1444,
        "zhai2": 1445,
        "xiong5": 1446,
        "suo5": 1447,
        "kou5": 1448,
        "ger2": 1449,
        "chong4": 1450,
        "zhuang5": 1451,
        "chui5": 1452,
        "o4": 1453,
        "kuai5": 1454,
        "kui3": 1455,
        "rang1": 1456,
        "rang5": 1457,
        "luo3": 1458,
        "shuo5": 1459,
        "jun5": 1460,
        "cir2": 1461,
        "bai5": 1462,
        "sou4": 1463,
        "nei3": 1464,
        "cai5": 1465,
        "sai5": 1466,
        "meng1": 1467,
        "banr3": 1468,
        "ceng1": 1469,
        "cha5": 1470,
        "huo5": 1471,
        "yanr3": 1472,
        "lao4": 1473,
        "ta5": 1474,
        "cheng4": 1475,
        "zaor3": 1476,
        "lang1": 1477,
        "P": 1478,
        "IY1": 1479,
        "dianr2": 1480,
        "diao3": 1481,
        "su5": 1482,
        "weng2": 1483,
        "weng3": 1484,
        "po3": 1485,
        "hui5": 1486,
        "hao1": 1487,
        "lang5": 1488,
        "niu4": 1489,
        "chuan5": 1490,
        "jue1": 1491,
        "ai5": 1492,
        "rang2": 1493,
        "gan5": 1494,
        "lie3": 1495,
        "ang4": 1496,
        "diao5": 1497,
        "pai5": 1498,
        "liu5": 1499,
        "dong5": 1500,
        "yir5": 1501,
        "pie2": 1502,
        "chu5": 1503,
        "die4": 1504,
        "zha3": 1505,
        "qiu3": 1506,
        "lou5": 1507,
        "o1": 1508,
        "ger4": 1509,
        "lou1": 1510,
        "mian5": 1511,
        "du5": 1512,
        "zhu5": 1513,
        "dan5": 1514,
        "huor3": 1515,
        "cha3": 1516,
        "huanr1": 1517,
        "wu5": 1518,
        "nao1": 1519,
        "hang4": 1520,
        "shuan5": 1521,
        "shu5": 1522,
        "mei1": 1523,
        "cui2": 1524,
        "rou5": 1525,
        "ha5": 1526,
        "chen5": 1527,
        "lu1": 1528,
        "tanr1": 1529,
        "yanr2": 1530,
        "suan5": 1531,
        "hun5": 1532,
        "huang5": 1533,
        "zao5": 1534,
        "wei5": 1535,
        "se5": 1536,
        "me1": 1537,
        "pian5": 1538,
        "lv5": 1539,
        "dir3": 1540,
        "chi5": 1541,
        "tu5": 1542,
        "nang1": 1543,
        "zhuan5": 1544,
        "xia5": 1545,
        "gang5": 1546,
        "far2": 1547,
        "a4": 1548,
        "tianr1": 1549,
        "qia2": 1550,
        "qun1": 1551,
        "xiao5": 1552,
        "mu5": 1553,
        "jian5": 1554,
        "pi5": 1555,
        "huir3": 1556,
        "chan5": 1557,
        "ng1": 1558,
        "mai5": 1559,
        "lei5": 1560,
        "qiang5": 1561,
        "zhur3": 1562,
        "shou5": 1563,
        "tongr4": 1564,
        "kuang5": 1565,
        "shai5": 1566,
        "jin5": 1567,
        "run5": 1568,
        "sang2": 1569,
        "chen3": 1570,
        "gua5": 1571,
        "zong5": 1572,
        "yingr3": 1573,
        "mi5": 1574,
        "ei5": 1575,
        "gair4": 1576,
        "jiao5": 1577,
        "bang5": 1578,
        "qiao5": 1579,
        "huor2": 1580,
        "ger3": 1581,
        "lie5": 1582,
        "yangr4": 1583,
        "lian5": 1584,
        "cao5": 1585,
        "jiar1": 1586,
        "dir2": 1587,
        "ran5": 1588,
        "ping5": 1589,
        "tui5": 1590,
        "xin5": 1591,
        "ne2": 1592,
        "dir4": 1593,
        "tuor3": 1594,
        "ling5": 1595,
        "lei1": 1596,
        "her2": 1597,
        "luo1": 1598,
        "yu5": 1599,
        "cheng5": 1600,
        "hao5": 1601,
        "lin5": 1602,
        "qian5": 1603,
        "chuang5": 1604,
        "niur1": 1605,
        "chao5": 1606
    },
    "idx2char": {
        "0": "ka2",
        "1": "er2",
        "2": "pu3",
        "3": "pei2",
        "4": "wai4",
        "5": "sun1",
        "6": "wan2",
        "7": "hua2",
        "8": "ti1",
        "9": "jia2",
        "10": "yu3",
        "11": "cun1",
        "12": "yan2",
        "13": "bie2",
        "14": "zai4",
        "15": "yong1",
        "16": "bao4",
        "17": "wo3",
        "18": "bao2",
        "19": "ma3",
        "20": "pei4",
        "21": "gua4",
        "22": "bo3",
        "23": "luo2",
        "24": "an1",
        "25": "diao1",
        "26": "chan2",
        "27": "yuan4",
        "28": "zhen3",
        "29": "dong3",
        "30": "weng1",
        "31": "ta4",
        "32": "deng4",
        "33": "xiao3",
        "34": "ping2",
        "35": "sa4",
        "36": "qie4",
        "37": "er3",
        "38": "hui4",
        "39": "wu4",
        "40": "lao2",
        "41": "hu3",
        "42": "you4",
        "43": "zai3",
        "44": "yu2",
        "45": "chong3",
        "46": "quan3",
        "47": "shua3",
        "48": "shen1",
        "49": "chang2",
        "50": "yue1",
        "51": "wu2",
        "52": "chi3",
        "53": "er4",
        "54": "cun4",
        "55": "wu3",
        "56": "fen1",
        "57": "huo4",
        "58": "yi3",
        "59": "shang4",
        "60": "zhao4",
        "61": "di2",
        "62": "cao2",
        "63": "yun2",
        "64": "teng2",
        "65": "qu4",
        "66": "gui3",
        "67": "wu1",
        "68": "zhan2",
        "69": "pin3",
        "70": "sui1",
        "71": "you3",
        "72": "zhan3",
        "73": "yuan2",
        "74": "que4",
        "75": "tui2",
        "76": "yi2",
        "77": "san3",
        "78": "ju1",
        "79": "tong2",
        "80": "he2",
        "81": "tuo1",
        "82": "wei2",
        "83": "zhu3",
        "84": "ke1",
        "85": "te4",
        "86": "ni1",
        "87": "chuan1",
        "88": "wen2",
        "89": "da4",
        "90": "yi1",
        "91": "yin3",
        "92": "cai2",
        "93": "yao4",
        "94": "shai1",
        "95": "yong4",
        "96": "ye3",
        "97": "nan2",
        "98": "yue4",
        "99": "kun1",
        "100": "lun2",
        "101": "shan1",
        "102": "xi1",
        "103": "zang4",
        "104": "jie1",
        "105": "rang3",
        "106": "kai3",
        "107": "lan2",
        "108": "fang2",
        "109": "ru3",
        "110": "xian4",
        "111": "ai2",
        "112": "xuan1",
        "113": "chuan2",
        "114": "hui2",
        "115": "heng1",
        "116": "heng5",
        "117": "zuo3",
        "118": "nai3",
        "119": "nai5",
        "120": "tiao1",
        "121": "xuan3",
        "122": "pi2",
        "123": "pa2",
        "124": "ci3",
        "125": "guang2",
        "126": "ben3",
        "127": "jiang1",
        "128": "you2",
        "129": "shao4",
        "130": "zhuang4",
        "131": "pai4",
        "132": "zhang2",
        "133": "guan3",
        "134": "man2",
        "135": "niao2",
        "136": "niao3",
        "137": "qiong2",
        "138": "ge1",
        "139": "yan3",
        "140": "kuang4",
        "141": "kuan1",
        "142": "kuo4",
        "143": "di1",
        "144": "ai3",
        "145": "bi2",
        "146": "duan3",
        "147": "xia2",
        "148": "ya2",
        "149": "cheng2",
        "150": "zhen4",
        "151": "qi2",
        "152": "wa3",
        "153": "yao2",
        "154": "shui3",
        "155": "wei4",
        "156": "meng2",
        "157": "zhang3",
        "158": "si1",
        "159": "yan4",
        "160": "lu4",
        "161": "bei4",
        "162": "xiu4",
        "163": "gou1",
        "164": "xing4",
        "165": "gan3",
        "166": "re2",
        "167": "huo3",
        "168": "ke2",
        "169": "gei3",
        "170": "ben2",
        "171": "wei3",
        "172": "fan3",
        "173": "ying4",
        "174": "you5",
        "175": "pai2",
        "176": "gai4",
        "177": "jian4",
        "178": "ying1",
        "179": "fang1",
        "180": "nai2",
        "181": "fen3",
        "182": "e4",
        "183": "yu4",
        "184": "lu2",
        "185": "wan3",
        "186": "su1",
        "187": "ju2",
        "188": "di4",
        "189": "xia4",
        "190": "xue1",
        "191": "zi5",
        "192": "guan1",
        "193": "dian3",
        "194": "zhai1",
        "195": "chen2",
        "196": "luo4",
        "197": "bi4",
        "198": "xiu1",
        "199": "hua1",
        "200": "xu3",
        "201": "guan4",
        "202": "yi4",
        "203": "ming2",
        "204": "ri4",
        "205": "chu1",
        "206": "bin4",
        "207": "a1",
        "208": "jiao1",
        "209": "bai3",
        "210": "gui2",
        "211": "kuang2",
        "212": "huan1",
        "213": "mai3",
        "214": "mai4",
        "215": "qi4",
        "216": "shou1",
        "217": "tiao2",
        "218": "liu4",
        "219": "wanr1",
        "220": "dou1",
        "221": "dei3",
        "222": "duo2",
        "223": "hei1",
        "224": "xiong2",
        "225": "chuang3",
        "226": "jin4",
        "227": "wang2",
        "228": "hui1",
        "229": "jia1",
        "230": "hou4",
        "231": "mi4",
        "232": "shi2",
        "233": "ya4",
        "234": "jun1",
        "235": "zhang4",
        "236": "fu5",
        "237": "cai4",
        "238": "kui2",
        "239": "xiao1",
        "240": "suan1",
        "241": "wei1",
        "242": "xian2",
        "243": "rong2",
        "244": "qiang2",
        "245": "mian2",
        "246": "zhe1",
        "247": "le5",
        "248": "yin1",
        "249": "xuan2",
        "250": "wo2",
        "251": "min3",
        "252": "yin2",
        "253": "chi1",
        "254": "mao3",
        "255": "liang2",
        "256": "zhi2",
        "257": "ke3",
        "258": "lv2",
        "259": "pao3",
        "260": "kuai4",
        "261": "feng1",
        "262": "ye2",
        "263": "de5",
        "264": "cha4",
        "265": "guo4",
        "266": "qir4",
        "267": "guang1",
        "268": "gun4",
        "269": "jie2",
        "270": "ying2",
        "271": "yun4",
        "272": "sheng1",
        "273": "gao1",
        "274": "ya1",
        "275": "tie2",
        "276": "ta3",
        "277": "peng2",
        "278": "dian4",
        "279": "hai3",
        "280": "pin2",
        "281": "min2",
        "282": "ku1",
        "283": "wan4",
        "284": "fu4",
        "285": "lie4",
        "286": "ling4",
        "287": "an4",
        "288": "chu2",
        "289": "li3",
        "290": "ru2",
        "291": "dai4",
        "292": "wo4",
        "293": "luan2",
        "294": "jian1",
        "295": "chui1",
        "296": "yan1",
        "297": "rao4",
        "298": "bo2",
        "299": "qing1",
        "300": "zui3",
        "301": "ba5",
        "302": "zhou1",
        "303": "lve4",
        "304": "zhong2",
        "305": "qi3",
        "306": "xiao4",
        "307": "sa2",
        "308": "man3",
        "309": "zhuang1",
        "310": "sha1",
        "311": "chang3",
        "312": "jing4",
        "313": "yun3",
        "314": "ming4",
        "315": "zhi4",
        "316": "zha2",
        "317": "dou4",
        "318": "pen1",
        "319": "xiang1",
        "320": "ma2",
        "321": "beng1",
        "322": "cui4",
        "323": "zi3",
        "324": "mei4",
        "325": "tuan2",
        "326": "shu3",
        "327": "zhen1",
        "328": "tai4",
        "329": "kou1",
        "330": "menr2",
        "331": "lin4",
        "332": "dong1",
        "333": "zhu4",
        "334": "bing4",
        "335": "xu1",
        "336": "shuan1",
        "337": "yang3",
        "338": "juan4",
        "339": "he4",
        "340": "li4",
        "341": "yin4",
        "342": "du4",
        "343": "lang2",
        "344": "nai4",
        "345": "jing1",
        "346": "shu4",
        "347": "nan4",
        "348": "xiong1",
        "349": "hao2",
        "350": "hao3",
        "351": "qie1",
        "352": "cuo1",
        "353": "tui3",
        "354": "nei4",
        "355": "ce4",
        "356": "yu1",
        "357": "ji2",
        "358": "ci2",
        "359": "kong2",
        "360": "zi2",
        "361": "tu2",
        "362": "nv2",
        "363": "pai1",
        "364": "wen3",
        "365": "xi4",
        "366": "chun1",
        "367": "bu2",
        "368": "pa4",
        "369": "cai3",
        "370": "cu4",
        "371": "fang3",
        "372": "zhi1",
        "373": "cu1",
        "374": "ni2",
        "375": "deng3",
        "376": "mian4",
        "377": "liao4",
        "378": "qiao3",
        "379": "miao4",
        "380": "se4",
        "381": "fu1",
        "382": "tie1",
        "383": "lou3",
        "384": "nu2",
        "385": "de2",
        "386": "ye1",
        "387": "wa2",
        "388": "qing3",
        "389": "yong3",
        "390": "kang1",
        "391": "zhuan3",
        "392": "da2",
        "393": "dui4",
        "394": "bang1",
        "395": "guo2",
        "396": "qin1",
        "397": "wen4",
        "398": "jin1",
        "399": "juan1",
        "400": "shen4",
        "401": "pang4",
        "402": "sao3",
        "403": "sao5",
        "404": "zuo4",
        "405": "wo1",
        "406": "wo5",
        "407": "yang2",
        "408": "rou4",
        "409": "dun4",
        "410": "man4",
        "411": "gang2",
        "412": "kou3",
        "413": "ya3",
        "414": "shu1",
        "415": "lao3",
        "416": "gong1",
        "417": "shai4",
        "418": "en1",
        "419": "ai4",
        "420": "wa4",
        "421": "tan1",
        "422": "ban3",
        "423": "quan2",
        "424": "ji4",
        "425": "chou2",
        "426": "zi1",
        "427": "jiu3",
        "428": "zha1",
        "429": "zou4",
        "430": "qu3",
        "431": "ti3",
        "432": "xue2",
        "433": "dao4",
        "434": "yuan3",
        "435": "wang3",
        "436": "gou4",
        "437": "sou1",
        "438": "gu3",
        "439": "xin4",
        "440": "ru4",
        "441": "weng4",
        "442": "kai2",
        "443": "mu3",
        "444": "xie2",
        "445": "chong1",
        "446": "ci4",
        "447": "diao4",
        "448": "tai2",
        "449": "huang2",
        "450": "chi4",
        "451": "san1",
        "452": "dao3",
        "453": "shang2",
        "454": "sheng4",
        "455": "huai2",
        "456": "chan3",
        "457": "ye4",
        "458": "ti4",
        "459": "zhe5",
        "460": "bei2",
        "461": "huan2",
        "462": "ban1",
        "463": "tang2",
        "464": "shang1",
        "465": "neng2",
        "466": "fou2",
        "467": "gai3",
        "468": "kong4",
        "469": "chuan4",
        "470": "mou2",
        "471": "bu4",
        "472": "lv3",
        "473": "qian2",
        "474": "zhe2",
        "475": "la1",
        "476": "fei2",
        "477": "shui2",
        "478": "ken2",
        "479": "she3",
        "480": "shi1",
        "481": "ta1",
        "482": "ne5",
        "483": "zei2",
        "484": "lou4",
        "485": "zi4",
        "486": "cheng1",
        "487": "huan4",
        "488": "zu2",
        "489": "zui4",
        "490": "cuo2",
        "491": "xia1",
        "492": "kua1",
        "493": "li2",
        "494": "da3",
        "495": "luan4",
        "496": "beng4",
        "497": "zhuo2",
        "498": "shuo1",
        "499": "xue3",
        "500": "jiao3",
        "501": "ruo4",
        "502": "lei4",
        "503": "miao2",
        "504": "duo1",
        "505": "chuan3",
        "506": "song2",
        "507": "kan4",
        "508": "kan5",
        "509": "tie3",
        "510": "hao4",
        "511": "zhe3",
        "512": "zhang1",
        "513": "biao2",
        "514": "pi1",
        "515": "zhuan1",
        "516": "xin1",
        "517": "gen1",
        "518": "lin3",
        "519": "zhun1",
        "520": "ding1",
        "521": "ning2",
        "522": "wang4",
        "523": "tian1",
        "524": "bu3",
        "525": "qing2",
        "526": "shi4",
        "527": "daor4",
        "528": "zou3",
        "529": "ren2",
        "530": "gao3",
        "531": "can1",
        "532": "xing2",
        "533": "wang1",
        "534": "fei1",
        "535": "zhen2",
        "536": "suo3",
        "537": "hou2",
        "538": "gan4",
        "539": "a5",
        "540": "ni3",
        "541": "lai2",
        "542": "da5",
        "543": "shei2",
        "544": "ka3",
        "545": "mei2",
        "546": "hai2",
        "547": "shou4",
        "548": "sun3",
        "549": "song4",
        "550": "ban4",
        "551": "pan2",
        "552": "zheng4",
        "553": "sun2",
        "554": "hui3",
        "555": "zhao2",
        "556": "lou2",
        "557": "kong1",
        "558": "long2",
        "559": "lin2",
        "560": "mai2",
        "561": "mo4",
        "562": "ji3",
        "563": "qiu1",
        "564": "hu4",
        "565": "fa4",
        "566": "gui1",
        "567": "mao4",
        "568": "xun4",
        "569": "gong4",
        "570": "sheng3",
        "571": "bao3",
        "572": "dan1",
        "573": "yuanr4",
        "574": "liu1",
        "575": "ji1",
        "576": "zhong1",
        "577": "zhan1",
        "578": "guang3",
        "579": "yao1",
        "580": "qian1",
        "581": "ke4",
        "582": "chong2",
        "583": "sou3",
        "584": "chai2",
        "585": "qin2",
        "586": "mou3",
        "587": "lian3",
        "588": "pen2",
        "589": "pu1",
        "590": "mie4",
        "591": "tao4",
        "592": "du2",
        "593": "wa5",
        "594": "yang4",
        "595": "kao3",
        "596": "que1",
        "597": "duan2",
        "598": "liang3",
        "599": "shang5",
        "600": "tai1",
        "601": "zheng5",
        "602": "ben1",
        "603": "hang2",
        "604": "duo4",
        "605": "jia3",
        "606": "yuan5",
        "607": "pao2",
        "608": "shi5",
        "609": "ba1",
        "610": "en4",
        "611": "huang1",
        "612": "fa1",
        "613": "dong4",
        "614": "tu4",
        "615": "kai1",
        "616": "sui4",
        "617": "bi3",
        "618": "po1",
        "619": "tu3",
        "620": "can2",
        "621": "shu2",
        "622": "bian1",
        "623": "nian2",
        "624": "ha1",
        "625": "jiu1",
        "626": "jun4",
        "627": "suan4",
        "628": "ku2",
        "629": "ze2",
        "630": "xing1",
        "631": "fen4",
        "632": "tun1",
        "633": "kou2",
        "634": "xian1",
        "635": "ling3",
        "636": "han4",
        "637": "gan1",
        "638": "die1",
        "639": "hong2",
        "640": "mo2",
        "641": "rui3",
        "642": "ka1",
        "643": "pian4",
        "644": "mei3",
        "645": "jie4",
        "646": "song1",
        "647": "ge2",
        "648": "mu4",
        "649": "bing3",
        "650": "mang3",
        "651": "she2",
        "652": "men2",
        "653": "ding3",
        "654": "duan1",
        "655": "tao2",
        "656": "feng4",
        "657": "rui4",
        "658": "nong5",
        "659": "chao2",
        "660": "liu2",
        "661": "ling2",
        "662": "dei2",
        "663": "yao3",
        "664": "ren3",
